//3. Вывести в консоль значения выражений и объяснить почему получились такие значения
// используя комментарии к каждому выражению:

alert(10 + 10 + "10")//2010 Все операции слева направо, первый плюс отрабатывает с числами,
                    // второй производит НПТ(Неявное преобразование типов),
                    // число 20 преобразует в строку 20 и конкатенирует строки

alert(10 + "10" + 10)// 101010 перед первым оператором НПТ в строку первого операнда,
                    // далее второй оператор НПТ третьего оператора в строку

alert(10 + 10 + +"10") //30 сначала унарная операция над третьим операндом, НПТ в число,
                    // далее все действия с числами

alert(10 / -"")//-Infinity сначала унарная операция преобразует  строку в -0, далее деление на -0

alert(10 / +"2,5")//NaN Унарная операция преобразует неправильную(?) строку в NaN.
                    // Далее деление на NaN дает NaN

