// Программа спрашивает у пользователя температуру в градусах по Цельсию (используем prompt чтобы ее получить).
// Используя alert программа выводит данную температуру в градусах по Фаренгейту.
//     Подсказка, расчёт идёт по формуле:
//     Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию.

'use strict'

let celsiy = parseInt(prompt('Введите температуру по Цельсию:'));

if (isNaN(celsiy)){
    alert('Невозможно преобразовать введеную строку в число');
} else {
    let fahrenheit = (9/5)*celsiy + 32
    alert(`Температура по Фаренгейту: ${fahrenheit}`);
}